# AnalysisDisplayColorSettings Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorSettings Constructor
AnalysisDisplayColorSettings Class See Also
---
Constructs a default instance of color settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayColorSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayColorSettings()
```

# See Also
AnalysisDisplayColorSettings Class
AnalysisDisplayColorSettings Overload
Autodesk.Revit.DB.Analysis Namespace